--[[ 
  ＤＥＶ→  @ali_moom#FFA179 
--]]
do
function run(msg, matches)
 if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🤚 اهـلـا بــکــم فـی قـائمـة الـاوامـر✋
┇🌟⭐️⭐️⭐️⭐️⭐️⭐️🌟┇
 ⇣ م1┇لـعـرض اوامـر الادمـنـيـة و الـمديـر☄

️⇣  م2┇ لـعـرض اوامـر الـمـيـديـا☄

️⇣ م3┇ لـعـرض اوامـر حـمـايـة ☄

️⇣ م4┇لـعـرض اوامـر بـالـتـحـذيـر☄

️⇣ م5┇ لـعـرض اوامـر الـمـجـمـوعـه ☄

️⇣ م6┇لـعـرض اوامـر الـمـطـوريـن ☄
]].."\n"
.."⇣ ┇ＴＶ→ＤＥＶ @DE_TAFON_V ⇣ ┇".."\n"
..'ＤＥＶ→ @ali_moom '..'\n'
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🌀الــاوامـــر الــثـــانــــویــــة🌀
📌➖➖➖🔵➖➖➖📌
⇣ ┇🌟رفــع ادمـــن🌟⇣ ┇
┇لـــرفــع ادمـــن رد + مــعـرف┇ 

⇣ ┇🌟تــنــزيــل ادمــن🌟⇣ ┇
┇ لـتـنـزیـل الــادمـن الــفاشــل┇ 

⇣ ┇🌟رفــع آدآريـــے🌟⇣ ┇
┇لــرفــع آدآریـــے لــلـمــجــمـوعــه┇
 
⇣ ┇🌟تــنــزيــل آدآريـــے🌟┇
┇لــتــنــزیــل الــا آدآریـــے الـفـاشــل┇ 

⇣ ┇🌟حـــظـــر🌟⇣ ┇
┇ حــظــر الــعــضــو الــفـاشـــل┇ 

⇣ ┇🌟الــغــاء حــظــر🌟⇣ ┇
┇الــغــاء الــحــظــر عــن عــضــو┇ 

⇣ ┇🌟مــنــع الــكــلـمــه🌟⇣ ┇
┇مـــثـــل مـــنــــع @┇ 

⇣ ┇🌟الــغــاء مــنــع + الــكــلــمــه🌟⇣ ┇
┇ مـــثــل الــغــاء مـــنـــع @┇  

⇣ ┇🌟قــائــمـــه الـــمــنــع🌟⇣ ┇
┇لــاظــهــار الــكــلــمــات الـمــمـنــوعــه┇ 

⇣ ┇🌟تــنــظــيــف قــائــمــه الــمـنـع🌟⇣ ┇
┇ لـمـسـح الکلـمـات الــممــنـوعــه ┇ 

⇣ ┇🌟 ايــــــدي🌟⇣ ┇
┇لـــعـــرض ایـــدي الــمجـمــوعــه┇ 

⇣ ┇🌟 ايـــدي بــالـــرد🌟⇣ ┇
┇لــعــرض ایـــدي الـــعــضـــو┇  

⇣ ┇🌟 كـــــتــم🌟⇣ ┇
┇لـــكــتــم الــعـضــو الــمــزعــج┇ 

⇣ ┇🌟الــمــكــتــومــيــن🌟⇣ ┇
┇لــعــرض قــائــمــه الـمكــتـومـيـن┇ 

⇣ ┇🌟 ضــع تــرحــيـب🌟⇣ ┇
┇لــوضــع تــرحــيـب لـلـمــجــمــوعــه┇ 

⇣ ┇🌟حـــذف الــتــرحــيــب🌟⇣ ┇
┇لــحــذف الــتــرحــيـب مــن للـمـجـمـوعـه┇
]].."\n"
.."|√🚸➖➖➖🔴➖➖➖🚸√|".."\n"
..'✳️ ＤＥＶ→ @ali_moom '..'\n'
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
*_✔ اوامـر قــفـل و فــتـح الــميديـا ✔_*


┇قــفــل 🔐 الــامــر لــلـقــفـل ┇
┇فــتــح 🔓 الــامــر لــلــفــتــح┇

⇣ ┇🌟الـــصـــوت 🌟┇

⇣ ┇🌟 الـــصـــور 🌟┇

⇣ ┇ 🌟الــفـــيـــديـــو🌟 ┇

⇣ ┇ 🌟الـــمــتــحــركــه🌟 ┇

⇣ ┇🌟 الــفــايـــلــات 🌟┇

⇣ ┇ 🌟الـــدردشـــه 🌟┇
]].."\n"
.."❇️➖➖🌟➖➖❇️".."\n"
..'ＤＥＶ→  @ali_moom '..'\n'
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🚸️اوامـــر الـــحمـــايــة⚠️

▫️️قـفـل🌟 الـامـر← لـلـقـفـل 
▪️فـتـح 🌟 الـامـر← لـلـفـتـح 
❇️➖➖🌟➖➖❇️

⇣┇🔸الــــانـــلـايــــن🔹┇⇣

⇣┇🔸الـــكـــلــايـــش🔹┇⇣

⇣┇🔸الــــــتـــــكـــرار🔹┇⇣

⇣┇🔸الـــــــطــــــــرد🔹┇⇣

⇣┇🔸الـــعــــربــيــــة🔹┇⇣

⇣┇🔸الـــجــــهــــات🔹┇⇣

⇣┇🔸الـــمـــــعـــرف🔹┇⇣

⇣┇🔸الــــــــتـــــاكــے🔹┇⇣

⇣┇🔸الـــشـــارحــــه🔹┇⇣

⇣┇🔸الــــاضـــــافـــه🔹┇⇣

⇣┇🔸الــــــروابـــــط🔹┇⇣

⇣┇🔸الــــبــــوتــــات🔹┇⇣

⇣┇🔸الـــســـمــايــل🔹┇⇣

⇣┇🔸الــمــلــصــقـات🔹┇⇣

⇣┇🔸الـــاشــعـــارات🔹┇⇣

⇣┇🔸اعـاده تـوجـيـه🔹┇⇣

⇣┇🔸الــــــدخــــــول🔹┇⇣

⇣┇🔸الــجـــمــاعــيــه🔹┇⇣

⇣┇🔸الـــتــعـــديــــل🔹┇⇣

❇️➖➖🌟➖➖❇️

]].."\n"
.."❇️➖➖🌟➖➖❇️".."\n"
..'ＤＥＶ→  @ali_moom '..'\n'
------------------

  elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[

🌟اوامـر قـفـل و فتـح بالتحـذيـر🌟 
قـفـل الـامـر 💥 للقفل 
فـتـح الـامـر 💥 لـلـفـتـح 

┇🌟الـروابـط بـالـتـحـذيـر☂┇
┇🌟الـتـوجـيـه بـالـتـحـذيـر☂┇
┇🌟الـصـور بـالـتـحـذيـر☂┇
┇🌟الـصـوت بـالـتـحـذيـر☂┇

┇🌟الـفـيـديـو بـالـتـحـذيـر☂┇
┇🌟الـدردشـه بـالـتـحـذيـر☂┇
┇🌟الـمـعـرف بـالـتـحـذيـر☂┇
┇🌟الـشـارحـه بـالـتـحـذيـر☂┇

┇🌟الـانـلـايـن بـالـتـحـذيـر☂┇
┇🌟الـتـاك بـالـتـحـذيـر☂┇
┇🌟الـسـمـايـل بـالـتـحـذيـر☂┇
┇🌟الـمـيــديـا بـالـتـحـذيـر☂┇

]].."\n"
.."❇️➖➖🌟➖➖❇️".."\n"
..'ＤＥＶ→  @ali_moom '..'\n'

------------------------

 elseif  matches[1] == "م5" and is_momod(msg) then 
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[

┇⇣اوامــر 🌟الــمـجـمـوعـه⇣┇

⇣ ┇🔘ضـــع صـــوره♦️┇⇣
⇣ ┇🔘لـــوضـــع صـــوره🔹┇⇣

⇣ ┇🔘ضــع قـــوانــيــن♦️┇⇣
⇣ ┇🔘لــوضــع قــوانــيـن🔹┇⇣

⇣ ┇🔘ضــع وصـــف♦️┇⇣
⇣ ┇🔘لـــوضــع وصـــف🔹┇⇣

⇣ ┇🔘ضــع اســــم♦️┇⇣
⇣ ┇🔘لـــوضـــع اســـم🔹┇⇣

⇣ ┇🔘ضـــع مـــعـــرف♦️┇⇣
⇣ ┇🔘لـــوضــع مــعــرف🔸┇⇣

⇣ ┇🔘ضــع رابــط♦️┇⇣
⇣ ┇🔘لـخـزن رابـط الــمـجـمـوعـه┇⇣

⇣ ┇🔘الــرابــط🔹┇⇣
⇣ ┇🔘لـعــرض رابـط الـمـجـمـوعـه♦️┇⇣
⇣ ┇🔘مــعــلــومــاتـي🔹┇⇣
⇣ ┇🔘لــعــرض مــعـلــومـاتــك🔸┇⇣

⇣ ┇🔘مـعـلـومـات الـمـجـمـوعـه♦️┇⇣
⇣ ┇🔘لـعـرض مـعـلـومـات الـمـجـمـوعـه🔸┇⇣

⇣ ┇🔘اعــدادت الــوسـائــط♦️┇⇣
⇣ ┇🔘لـاضـهـار الـاعـدادات الـوسـائـط🔸┇⇣


]].."\n"
.."❇️➖➖🌟➖➖❇️".."\n"
..'ＤＥＶ→  @ali_moom '..'\n'
-----------------------

 elseif  matches[1] == "م6" and is_sudo(msg) then 
    return "اهــلــا عــزيــزي"..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
😎اوامــر تـخـص الـمـطـوريـن 🤓
🔻------------------------🔻
┇🌟تــفــعــيــل🌟┇
┇🌟لـتـفـعـيـل الـبـوت بـالـمـجـمـوعـه🌟┇
┇🌟تـعـطــيـل🌟┇
┇🌟لـتـعـطـيـل الـبـوت بـالـمـجـمـوعـه🌟┇ 

┇🌟رفــع الــمــديــر🌟┇ 
┇🌟لـرفـع الـمـديـر بــل رد🌟┇ 
┇🌟وضـع وقـت + عـدد الـايـام🌟┇
┇🌟لـتـفـعـيـل الـبـوت ع عــدد الـايـام🌟┇

┇🌟الــوقـــت🌟┇
┇🌟لـمـعـرفـت عـدد ايـام تـفـعـیـل🌟 ┇
┇🌟اذاعـــــه🌟 ┇
┇🌟لـنـشـر شـئ بـكــل مـجـمـوعـات🌟 ┇

┇🌟زحــلــك🌟┇
┇🌟لــا اخـراج الـبــوت مـن الـمـجـمـوعـة🌟┇
┇🌟جـلـب مـلـف ➕ اسـم الـمـلـف🌟┇ 
┇🌟لـجـلـب مـلـف مـن سـيـرفـر 🌟┇

┇🌟تـفـعـيـل ➕ اسـم الـمـلـف🌟 ┇
┇🌟لـتـفـعـيـل مـلـف عـن طـريـق الـبـوت🌟┇
┇🌟تـعـطـيـل➕اسـم لـلـمـلـف🌟┇
┇🌟لـتـعـطـيـل مـلـف عـن طـريـق الـبـوت🌟┇

┇🌟صـنـع مـجـمـوعـه➕الاسم🌟┇
┇🌟لـصـنـع مـجـمـوعـه بـواسـطـه الـبـوت🌟┇
┇🌟 تـرقـيـه ســوبــر🌟┇ 
┇🌟لـتـرقـيـه الـمـجـمـوعـه سـوبـر🌟┇
]].."\n"
.."❇️➖➖🌟➖➖❇️".."\n"
..'ＤＥＶ→  @ali_moom '..'\n'
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^(م6)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)",
    "^[#!/](م6)"
  },
  run = run
}
end


--[[ 
   ＤＥＶ→  @ali_moom#FFA179
--]]
