--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
do
function run(msg, matches)
 if matches[1] == "الاوامر" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🤚 اهـلـا بــکــم فـی قـائمـة الـاوامـر✋
┇🌟⭐️⭐️⭐️⭐️⭐️⭐️🌟┇
 ⇣ م1┇لـعـرض اوامـر الادمـنـيـة و الـمديـر☄

️⇣  م2┇ لـعـرض اوامـر الـمـيـديـا☄

️⇣ م3┇ لـعـرض اوامـر حـمـايـة ☄

️⇣ م4┇لـعـرض اوامـر بـالـتـحـذيـر☄

️⇣ م5┇ لـعـرض اوامـر الـمـجـمـوعـه ☄

️⇣ م6┇لـعـرض اوامـر الـمـطـوريـن ☄
]].."\n"
.."⇣ ┇ＴＶ→ＤＥＶ @DE_TAFON_V ⇣ ┇".."\n"
..'ＤＥＶ→ @ali_moom '..'\n'
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🌀الــاوامـــر الــثـــانــــویــــة🌀
📌➖➖➖🔵➖➖➖📌
⇣ ┇🌟رفــع ادمـــن🌟⇣ ┇
┇لـــرفــع ادمـــن رد + مــعـرف┇ 
⇣ ┇🌟تــنــزيــل ادمــن🌟⇣ ┇
┇ لـتـنـزیـل الــادمـن الــفاشــل┇ 
⇣ ┇🌟رفــع آدآريـــے🌟⇣ ┇
┇لــرفــع آدآریـــے لــلـمــجــمـوعــه┇ 
⇣ ┇🌟تــنــزيــل آدآريـــے🌟┇
┇لــتــنــزیــل الــا آدآریـــے الـفـاشــل┇ 
⇣ ┇🌟حـــظـــر🌟⇣ ┇
┇ حــظــر الــعــضــو الــفـاشـــل┇ 
⇣ ┇🌟الــغــاء حــظــر🌟⇣ ┇
┇الــغــاء الــحــظــر عــن عــضــو┇ 
⇣ ┇🌟مــنــع الــكــلـمــه🌟⇣ ┇
┇مـــثـــل مـــنــــع @┇ 
⇣ ┇🌟الــغــاء مــنــع + الــكــلــمــه🌟⇣ ┇
┇ مـــثــل الــغــاء مـــنـــع @┇  
⇣ ┇🌟قــائــمـــه الـــمــنــع🌟⇣ ┇
┇لــاظــهــار الــكــلــمــات الـمــمـنــوعــه┇ 
⇣ ┇🌟تــنــظــيــف قــائــمــه الــمـنـع🌟⇣ ┇
┇ لـمـسـح الکلـمـات الــممــنـوعــه ┇ 
⇣ ┇🌟 ايــــــدي🌟⇣ ┇
┇لـــعـــرض ایـــدي الــمجـمــوعــه┇ 
⇣ ┇🌟 ايـــدي بــالـــرد🌟⇣ ┇
┇لــعــرض ایـــدي الـــعــضـــو┇  
⇣ ┇🌟 كـــــتــم🌟⇣ ┇
┇لـــكــتــم الــعـضــو الــمــزعــج┇ 
⇣ ┇🌟الــمــكــتــومــيــن🌟⇣ ┇
┇لــعــرض قــائــمــه الـمكــتـومـيـن┇ 
⇣ ┇🌟 ضــع تــرحــيـب🌟⇣ ┇
┇لــوضــع تــرحــيـب لـلـمــجــمــوعــه┇ 
⇣ ┇🌟حـــذف الــتــرحــيــب🌟⇣ ┇
┇لــحــذف الــتــرحــيـب مــن للـمـجـمـوعـه┇
]].."\n"
.."|√🚸➖➖➖🔴➖➖➖🚸√|".."\n"
..'✳️ ＤＥＶ→ @ali_moom '..'\n'
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 ✔️ اوامـر قــفـل و فــتـح الــميديـا ✔️
|❗️| -------------------------- |❗️|
قفل + الامر / للقفل ☑️
فتح + الامر / للفتح  ⚠️
|❗️| -------------------------- |❗️|

|📍| الصوت |🔊
|📍| الصور |🌠
|📍| الفيديو |🎥
|📍| المتحركه |🃏
|📍| الفايلات |🗂
|📍| الدردشه |📇
]].."\n"
.."|❗️| -------------------------- |❗️|".."\n"
..'|❗️| CH | @lTSHAKEl_CH '..'\n'
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
📛اوامـــر حمـــايه الـــمجمـــوعه📛
|❗️| -------------------------- |❗️|
قفل + الامر / للقفل ☑️
فتح + الامر / للفتح  ⚠️
|❗️| -------------------------- |❗️|

|📍| الانلاين |📡
|📍| الكلايش |🚸
|📍| التكرار |🔖
|📍| الطرد |📛

|📍| العربيه |🆎
|📍| الجهات |📩
|📍| المعرف |🌀
|📍| التاك |📥
|📍| الشارحه |〰

|📍| الاضافه |👥
|📍| الروابط |♻️
|📍| البوتات |✳️
|📍| السمايل |😃
|📍| الملصقات |🔐

|📍| الاشعارات |🎌
|📍| اعاده توجيه |↪️
|📍| الدخول |📍
|📍| الجماعيه |❗️
|📍| التعديل |🔏
]].."\n"
.."|❗️| -------------------------- |❗️|".."\n"
..'|❗️| CH | @lTSHAKEl_CH '..'\n'
------------------

  elseif  matches[1] == "م4" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
✔️ اوامـر قــفـل و فتـح بالتـحـذيـر ✔️
|❗️| -------------------------- |❗️|
قفل + الامر / للقفل ☑️
فتح + الامر / للفتح  ⚠️
|❗️| -------------------------- |❗️|

|📍| الروابط بالتحذير |♻️
|📍| التوجيه بالتحذير |↪️
|📍| الصور بالتحذير |🌠
|📍| الصوت بالتحذير |🔊

|📍| الفيديو بالتحذير |🎥
|📍| الدردشه بالتحذير |📇
|📍| المعرف بالتحذير |🌀
|📍| الشارحه بالتحذير |〰

|📍| الانلاين بالتحذير |📡
|📍| التاك بالتحذير |📥
|📍| السمايل بالتحذير |😃
|📍| الميديا بالتحذير |📬
]].."\n"
.."|❗️| -------------------------- |❗️|".."\n"
..'|❗️| CH | @lTSHAKEl_CH '..'\n'

------------------------

 elseif  matches[1] == "م5" and is_momod(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔹- اوامــر تــخــص  المـجـمـوعـه 👁‍🗨
|❗️| -------------------------- |❗️|

|📍| ضع صوره
|🎐| لوضع صوره 
|📍| ضع قوانين
|🎐| لوضع قوانين 

|📍| ضع وصف
|🎐| لوضع وصف  
|📍| ضع اسم
|🎐| لوضع اسم  

|📍| ضع  معرف
|🎐| لوضع معرف 
|📍| ضع رابط
|🎐| لخزن رابط المجموعه

|📍| الرابط
|🎐| لعرض رابط المجموعه 
|📍| معلوماتي
|🎐| لعرض معلوماتك

|📍| معلومات المجموعه
|🎐| لعرض معلومات المجموعه
|📍| اعدادت الوسائط
|🎐| لاضهار الاعدادات الوسائط
]].."\n"
.."|❗️| -------------------------- |❗️|".."\n"
..'|❗️| CH | @lTSHAKEl_CH '..'\n'
-----------------------

 elseif  matches[1] == "م6" and is_sudo(msg) then 
    return "اهلا وسهلا بك 😻🎈 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔧 اوامـــر المــطـــوريـــن  ⚙
|❗️| -------------------------- |❗️|

|📍| تفعيل 
|🎐| لتفعيل البوت بالمجموعه 
|📍| تعطيل 
|🎐| لتعطيل البوت بالمجموعه 

|📍| رفع المدير 
|🎐| لرفع المدير عن طريق الرد + معرف  
|📍| وضع وقت + عدد الايام
|🎐| لتفعيل البوت ع عدد الايام

|📍| الوقت
|🎐| لمعرفت عدد ايام تفعيل البوت
|📍| اذاعه 
|🎐| لنشر شئ بكل مجموعات البوت 

|📍| زحلك 
|🎐| لطرد البوت من المجموعه 
|📍| جلب ملف + اسم الملف    
|🎐| لجلب ملف من سيرفر البوت 

|📍| تفعيل + اسم الملف 
|🎐| لتفعيل ملف عن طريق البوت
|📍| تعطيل + اسم للملف
|🎐| لتعطيل ملف عن طريق البوت

|📍| صنع مجموعه + الاسم 
|🎐| لصنع مجموعه بواسطه البوت
|📍| ترقيه سوبر  
|🎐| لترقيه المجموعه بواسطه البوت
]].."\n"
.."|❗️| -------------------------- |❗️|".."\n"
..'|❗️| CH | @lTSHAKEl_CH '..'\n'
------------------
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م5)",
    "^(م6)",
    "^[#!/](الاوامر)",
    "^[#!/](م1)",
    "^[#!/](م2)",
    "^[#!/](م3)",
    "^[#!/](م4)",
    "^[#!/](م5)",
    "^[#!/](م6)"
  },
  run = run
}
end


--[[ 
    _____    _        _    _    _____    Dev @lIMyIl 
   |_   _|__| |__    / \  | | _| ____|   Dev @li_XxX_il
     | |/ __| '_ \  / _ \ | |/ /  _|     Dev @h_k_a
     | |\__ \ | | |/ ___ \|   <| |___    Dev @Aram_omar22
     |_||___/_| |_/_/   \_\_|\_\_____|   Dev @IXX_I_XXI
              CH > @lTSHAKEl_CH
--]]
