-- made by { @ali_moom } 
do 
ws = {} 
rs = {} 

-- some examples of how to use this :3 
ws[1] = "هلو"   --msg 
rs[1] = "هـــ♪ــݪآؤآٺ💗|☂"   --replaY 

ws[2] = "تايفون"
rs[2] = "عـــ๋͜͡ــيـــ๋͜͡ــون تـــ๋͜͡ــايـــ๋͜͡ــفـــ๋͜͡ــون•💁🏼‍♂✨﴿ֆ ❥"

ws[3] = "هلا" 
rs[3] = "هـــ๋͜͡ــلـــ๋͜͡ــابـــ๋͜͡ــيـــ๋͜͡ــك عـــ๋͜͡ــزيـــ๋͜͡ــزي♩⁽😻🌸⁞♩"

ws[4] = "شلونك" 
rs[4] = "تـــ๋͜͡ــمـــ๋͜͡ــام حـــ๋͜͡ــبحـــ๋͜͡ــيـــ๋͜͡ــاتـــ๋͜͡ــي• ⁽🙆🏻🍿₎"

ws[5] = "شلونكم"   --msg 
rs[5] = "تـــ๋͜͡ــمـــ๋͜͡ــام وانـــ๋͜͡ــت💜💭℡ֆ‘ " --reply 

ws[6] = "تمام" 
rs[6] = "عـــ๋͜͡ــســـ๋͜͡ــا دوـــ๋͜͡ــم•🙊💙﴿ֆ ❥"
ws[7] = "دوم" 
rs[7] = "دامـــ๋͜͡ــت ايـــ๋͜͡ــامـــ๋͜͡ــك┊⁽℡̮ 😼💛⇣ "

ws[8] = "تخليني" 
rs[8] = "اخـــ๋͜͡ــلـــ๋͜͡ــيـــ๋͜͡ــك نـــ๋͜͡ــعـــ๋͜͡ــال•⚖️💙﴿ֆ"

ws[9] = "هلاو" 
rs[9] = "هـــ๋͜͡ــلـــ๋͜͡ــابـــ๋͜͡ــيـــ๋͜͡ــك عـــ๋͜͡ــزيـــ๋͜͡ــزي♩⁽😻🌸⁞♩"
ws[10] = "🌝" 
rs[10] = "نـــ๋͜͡ــوت حـــ๋͜͡ــمـــ๋͜͡ــبـــ๋͜͡ــيۦٰ‏┋❥ ͢˓🦁💛ۦٰ‏"

ws[11] = "انجب" 
rs[11] = "انـــ๋͜͡ــتـــ๋͜͡ــه₎✿💥😈 ⁞“❥"

ws[12] = "احبك" 
rs[12] = "امـــ๋͜͡ــوت عـــ๋͜͡ــلـــ๋͜͡ــيـــ๋͜͡ــك’ֆ💧💆🏻⍤"

ws[13] = "اكرهك" 
rs[13] = "وانـــ๋͜͡ــي شـــ๋͜͡ــعـــ๋͜͡ــلـــ๋͜͡ــيـــ๋͜͡ــه☫ۦٰ️💛#ֆ’ٰ"

ws[14] = "تحبني" 
rs[14] = "اذا بـــ๋͜͡ــنيـــ๋͜͡ــه تـــ๋͜͡ــعالـــ๋͜͡ــي خـــ๋͜͡ــاص وﺄذ ﺄ ولـــ๋͜͡ــد ديــﮯ”✤🙇🏻‍♀️🌿℡"

ws[15] = "محمد" 
rs[15] = "ضـــ๋͜͡ــلـــ๋͜͡ــع عـــ๋͜͡ــلـــ๋͜͡ــوش مـــ๋͜͡ــطـــ๋͜͡ــوري☫ۦٰ️💛#ֆ’ٰ⁽ֆᵛ͢ᵎᵖ✨🔖⁾"

ws[16] = "حسام" 
rs[16] = "تـــ๋͜͡ــاج راســـ๋͜͡ــكـــ๋͜͡ــم☫ۦٰ️💛#ֆ’ٰ☫ۦٰ️💛#ֆ’ٰ"

ws[17] = "مرتضی"
rs[17] = "احـــ๋͜͡ــلا مـــ๋͜͡ــطـــ๋͜͡ــور فـــ๋͜͡ــديـــ๋͜͡ــتـــ๋͜͡ــه℠⁽“ֆ🍃🌙ᴖ̈"

ws[18] = "كسمك" 
rs[18] = "نـــچـــب ابـــن کـــحــبـــتـــي تــره اصــیــحــلـــک الــصــخــره😂"

ws[19] = "علوش"
rs[19] = "احـــ๋͜͡ــلا مـــ๋͜͡ــطـــ๋͜͡ــور فـــ๋͜͡ــديـــ๋͜͡ــتـــ๋͜͡ــه℠⁽“ֆ🍃🌙ᴖ̈"

ws[20] = "🌚" 
rs[20] = "صـــ๋͜͡ــخـــ๋͜͡ــمـــ๋͜͡ــت الـــ๋͜͡ــكـــ๋͜͡ــروب حـــ๋͜͡ــبـــ๋͜͡ــي⚡️🌞 •|•℡"

ws[21] = "😐" 
rs[21] = "لـــ๋͜͡ــاتـــ๋͜͡ــصـــ๋͜͡ــفـــ๋͜͡ــن هـــ๋͜͡ــواي تـــ๋͜͡ــمـــ๋͜͡ــوت بـــ๋͜͡ــسرعـــ๋͜͡ــه⁞♩⁽🌞🌩₎⇣✿"

ws[22] = "🙄" 
rs[22] = "نـــ๋͜͡ــزل عـــ๋͜͡ــيـــ๋͜͡ــنـــ๋͜͡ــك لـــ๋͜͡ــا تـــ๋͜͡ــنـــ๋͜͡ــحـــ๋͜͡ــوـــ๋͜͡ــل⁞“ٰۦ˛⁽💆🏻‍♂🌙₎⇣✿"

ws[23] = "😒" 
rs[23] = "شـــ๋͜͡ــبـــ๋͜͡ــيـــ๋͜͡ــك وجـــ๋͜͡ــهـــ๋͜͡ــك خـــ๋͜͡ــايـــ๋͜͡ــسֆ 💛💭ۦٰ"

ws[24] = "اريد بوت" 
rs[24] = "راســـ๋͜͡ــل عـــ๋͜͡ــلـــ๋͜͡ــوش  @ali_moom  ⁞⚡️♛ֆ₎"

ws[25] = "وين المدير" 
rs[25] = "نـــ๋͜͡ــايـــ๋͜͡ــم كـــ๋͜͡ــول امـــ๋͜͡ــر خـــ๋͜͡ــدمـــ๋͜͡ــه“̯ 🐼💗 |℡"

ws[26] = "اه" 
rs[26] = "تـــ๋͜͡ــنـــ๋͜͡ــح راح ادخـــ๋͜͡ــلـــ๋͜͡ــه‏‎‏ ⁾⇣✿🍆"

ws[27] = "باي" 
rs[27] = "لـــ๋͜͡ــا تـــ๋͜͡ــروح ضـــ๋͜͡ــوجـــ๋͜͡ــه ֆ 💭💔ۦٰ"

ws[28] = "كفو" 
rs[28] = "كـــ๋͜͡ــفـــ๋͜͡ــوك الـــ๋͜͡ــطـــ๋͜͡ــيـــ๋͜͡ــبۦٰ‏┋❥ ͢˓🦁💛ۦٰ‏"

ws[29] = "فرخ" 
rs[29] = "ويـــ๋͜͡ــنـــ๋͜͡ــه خـــ๋͜͡ــن انـــ๋͜͡ــيـــ๋͜͡ــجـــ๋͜͡ــه℡ 🌞🔥͎‏‎‏ ⁾┊❥"

ws[30] = "شباب" 
rs[30] = "نـــ๋͜͡ــعـــ๋͜͡ــم تـــ๋͜͡ــفـــ๋͜͡ــضـــ๋͜͡ــل⋮⁽🌔☄₎ٰۦ˛"

ws[31] = "سرسري"
rs[31] = "فـــ๋͜͡ــديـــ๋͜͡ــتـــ๋͜͡ــه لـــ๋͜͡ــو اكـــ๋͜͡ــضـــ๋͜͡ــه الـــ๋͜͡ــه🔞₎✿💥😈 ⁞“❥"

ws[33] = "فديت"
rs[33] = "فـــ๋͜͡ــداك الـــ๋͜͡ــكـــ๋͜͡ــون وعـــ๋͜͡ــون وفـــ๋͜͡ــرعـــ๋͜͡ــون•🌱💚﴿ֆ ❥ "

ws[34] = "خاص"
rs[34] = "اثـــ๋͜͡ــكـــ๋͜͡ــل حـــ๋͜͡ــمبـــ๋͜͡ــي‏┆💙🙋🏼‍♂♕ "

ws[35] = "تعال خاص"
rs[35] = "مـــ๋͜͡ــا ازحـــ๋͜͡ــف انـــ๋͜͡ــي⁞✦⁽☻🔥₎“ٰۦ"

ws[36] = "تعالي خاص"
rs[36] = "لـــ๋͜͡ــا تـــ๋͜͡ــزحـــ๋͜͡ــف حـــ๋͜͡ــمبـــ๋͜͡ــي┋⁽❥̚͢₎ 🐣💗 "

ws[37] = "زاحف"
rs[37]  = "عـــ๋͜͡ــلـــ๋͜͡ــى اخـــ๋͜͡ــتـــ๋͜͡ــك﴿💆🏼💗ֆ "

ws[38] = "دي"
rs[38] = "اتـــ๋͜͡ــجـــ๋͜͡ــاهـــ๋͜͡ــلك فـــ๋͜͡ــرخ┋⁽❥̚͢₎ 🐣💗"

ws[39] = "😳"
rs[39] = "شـــ๋͜͡ــبـــ๋͜͡ــيك مـــ๋͜͡ــصـــ๋͜͡ــدوم😴🌸✿⇣"

ws[40] = "😕"
rs[40] = "شـــ๋͜͡ــبـــ๋͜͡ــيك مـــ๋͜͡ــصـــ๋͜͡ــدوم😴🌸✿⇣"

ws[41] = "🚶🏿💔"
rs[41] = "شـــ๋͜͡ــبـــ๋͜͡ــيـــ๋͜͡ــك  💛💭ۦٰ"

ws[44] = "بوت"
rs[44] = "نـــ๋͜͡ــعـــ๋͜͡ــم تـــ๋͜͡ــفـــ๋͜͡ــضـــ๋͜͡ــل⋮⁽🌔☄₎ٰۦ˛"

ws[45] = "ضوجه"
rs[45] = "هـــ๋͜͡ــيـــ๋͜͡ــا هـــ๋͜͡ــاي الـــ๋͜͡ــدنـــ๋͜͡ــيـــ๋͜͡ــه♛⇣🐰☄₎✦"

ws[46] = "🙂"
rs[46] = "لـــ๋͜͡ــاتـــ๋͜͡ــصـــ๋͜͡ــفـــ๋͜͡ــن هـــ๋͜͡ــواي تـــ๋͜͡ــمـــ๋͜͡ــوت بـــ๋͜͡ــسرعـــ๋͜͡ــه⁞♩⁽🌞🌩₎⇣✿"

ws[48] = "منو المطور"
rs[48] = "عـــ๋͜͡ــلـــ๋͜͡ــوش⁞⚡️♛ֆ₎"

ws[51] = "شسمك"
rs[51] = "تـــ๋͜͡ــايـــ๋͜͡ــفـــ๋͜͡ــون• 🐼🌿﴾ֆ"

ws[52] = "شنو اسم البوت"
rs[52] = "تـــ๋͜͡ــايـــ๋͜͡ــفـــ๋͜͡ــون• 🐼🌿﴾ֆ"

ws[53] = "افلش"
rs[53] = "تـــ๋͜͡ــم دفـــ๋͜͡ــرك مـــ๋͜͡ــن المـــ๋͜͡ــجمـــ๋͜͡ــوعـــ๋͜͡ــه⁞♩⁽🌞🌩₎⇣✿"

ws[71] = "سجاد"
rs[71] = "مہٰٖو بحہٰٖالكے القہٰٖائہٰٖد 🎤 🚶"
ws[72] = "الاصدار"
rs[72] = "سورس تايفون\nالاصدار - 1\nمطور البوت - علووش [@ali_moom]\nرابط الكيث هوب - []

-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "ali_moom" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "@Sudo_Sky" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end
